移动到行尾$，移动到行首0（数字），移动到行首第一个字符处^
移动到文档开始gg，移动到文档结束G
跳到第n行 ngg 或 nG 或 :n
读取当前单词，并移动到本屏幕内下一次出现的地方 *
读取当前字符，并移动到本屏幕内上一次出现的地方 #
33G：跳转到33行   此时按``可以返回到原来行
zz:将当前行滚动于屏幕中间，方便查看上下文  zt置顶，zb置尾
ctrl+u\d  向上\下滚动半屏
ctrl+e\y  向上\下滚动一行
ctrl+b\f  向上\下滚动一屏　　这个比较实用，记住。


基本替换 :s/s1/s2 （将下一个s1替换为s2）
全部替换 :%s/s1/s2
只替换当前行 :s/s1/s2/g
替换某些行 :n1,n2 s/s1/s2/g
搜索模式为 /string，搜索下一处为n，搜索上一处为N
如果要查找的字符中有斜杠, 可以在前面添加反斜杠\, 进行转义


光标后插入a, 行尾插入A
后插一行插入o，前插一行插入O
删除字符插入s， 删除正行插入S
光标前插入i，行首插入I

删除一行dd，删除后进入插入模式cc或者S
D 删除到行尾
删除一个单词dw，删除一个单词进入插入模式cw
删除一个字符x或者dl，删除一个字符进入插入模式s或者cl, 删除3个字符就是3x


复制y，复制一行yy
撤销u, U:撤销当前行的所有修改
对撤消的撤消 ctrl + r，重复.
粘贴 p

Nyy可以复制光标后的N行。
有时我们不容易得出行数，这时可以用做标记的方法来制定复制范围：
　　1. 在开始行上输入ma作一个标记a
　　2. 移动到结束行，输入y'a会复制当前行到标记a之间的文本。d'a会删除。
或者是v进入可视模式，再13G跳转到相应行，y即可。 13是跳转到的行数, 会复制当前行到第13行之间的所有文本
:10,20y    回车即可，相应的删除也是如此     :10,20d
:10,20 m 30    把10行到20行的内容，剪切到30行之后
:10,20 co 30   把10行到20行的内容，复制到30行之后

将光标放在 { 处，然后输入v%就可以把大括号中内容选定
如果光标放在第一个s上，想删除到“(”为止，则输入dt(就可以了，t(的作用是跳到下一个"("前。

v进入可视模式, 上下即可选中多行

ctrl +n 自动补全 ctrl + p 也一样
% 移动到与制匹配的括号上去（），{}，[]，<>等
可以使用多重剪切板，查看状态使用:reg，使用剪切板使用”，例如复制到w寄存器，”wyy，或者使用可视模式v”wy


>> 缩进所有选择的代码
<< 反缩进所有选择的代码
合并两行 J 删除换行符，使下一行并上来
若不想保存文件，而重新打开 :e!
若想打开新文件 :e filename，然后使用ctrl + ^进行文件切换

ZZ或者:wq保存并退出

Ctrl+G:显示当前位置

:set number:设置显示行号，set nonumber:关闭显示
:set ruler 设置在窗口右下角显示行号，与上面的好处是，节省空间


显示行号
在 vim 里执行(在普通模式下直接按冒号，并输入下面的命令)
1
:set number
或者简单 :set nu
回车后就可以显示行号了，但重启 vim 后又会恢复默认的设置。


要想每次进入 vim 都显示行号就需要配置 vimrc 文件。按如下方法进行：
1
:e $MYVIMRC
来打开 vimrc 文件。然后按(在普通模式下)

1
Go
跳到最后一行并另起一行开始插入模式。
输入：
1
:set number
然后
1
<ESC>:wq
退出插入模式并存盘退出。
以后再打开 vim 就会每次显示行号了。
